//"use strict";
// Задания по JavaScript
// Определите переменные str, num, flag и txt со значениями «Привет», 123, true, «true». При помощи оператора определения типа убедитесь, что переменных принадлежат типам: string, number, boolean.

var str = "Привет";
var num = 123;
var flag = true;
var txt = "true";

console.log(typeof(str));
console.log(typeof(num));
console.log(typeof(flag));
console.log(typeof(txt));

// Создайте переменные a1, a2, a3, a4, a5. При помощи математических операторов (сложение, вычитание и т.д.) найдите значения выражений:
// 5 + 3,
// 5 - 3,
// 5 * 3,
// 5 / 3,
// поместив результат каждого выражения в соответствующую переменную. Например, let a1 = 5 + 3.

let a1 = 5 + 3;
let a2 = 5 - 3;
let a3 = 5 * 3;
let a4 = 5 / 3;

console.log(a1);
console.log(a2);
console.log(a3);
console.log(a4);

// let a1;
// let a2;
// let a3;
// let a4;

//     a1 = 5 + 3;
//     a2 = 5 - 3;
//     a3 = 5 * 3;
//     a4 = 5 / 3;

// console.log(a1);
// console.log(a2);
// console.log(a3);
// console.log(a4);

// Создайте переменные a6, a7, a8, a9, a10. Поместите в них результат выражений:
// 5 % 3,
// 3 % 5,
// 5 + '3',
// '5' - 3,
// 75 + 'кг'
// .

let a6 = 5 % 3; 
let a7 = 3 % 5; 
let a8 = 5 + '3';
let a9 = '5' - 3;
let a10 = 75 + 'кг'; 

console.log(a6); //2
console.log(a7); //3
console.log(a8); //"53"
console.log(a9); //2
console.log(a10); //"75кг"


// Напишите скрипт, который находит площадь прямоугольника высота 23см. (в числовую переменную height), шириной 10см (в числовую переменную width), значение площади должно хранится в числовой переменной s.

let height = 23;
let width = 10;
let s;

    s = height * width;

console.log("Площадь прямоугольника равна: " + s + " см");

// Напиши скрипт, который находит объем цилиндра высотой 10м (переменная heightC) и диаметром основания 4м (dC), результат поместите в переменную v.

let heightC = 10;
let dC = 4;
let v;

// v = pr(квадр)*h

v = (Math.PI * (Math.pow((dC/2), 2)) * heightC);

console.log("Объем цилиндра высотой " + heightC + " м" + " и диаметром основания " + dC + " м" + " равен: " + (+v.toFixed(2)) + " куб.м.");

// У прямоугольного треугольника две стороны n (со значением 3) и m (со значением 4). Найдите гипотенузу k по теореме Пифагора (нужно использовать функцию Math.pow(число, степень) или оператор возведения в степень ** ).

let n = 3;
let m = 4;
let k;

    k = Math.sqrt(Math.pow(n, 2) + Math.pow(m, 2));

console.log("Гипотенуза равна: " + k);


// (*) Даны размер ипотечного кредита (S — 2 млн.руб), процентная ставка (p  — 10%), кол-во лет (years — 5). Найти переплату по кредиту, значение переплаты должно содержаться в переменной perepl.

let sum = 2;
let p = 10;
let years = 5;
let perepl;

    perepl = (sum * (p / 100)) * years;

console.log("Переплата по кредиту будет " + perepl + " млн.руб");
